In [4]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.072507  0.126164
1    a  two  0.043014 -0.886642
2    b  one -0.173398 -0.231856
3    b  two  1.624898 -0.533099
4    a  one  0.826580  0.241949

In [8]:
grouped = df.groupby(by=["台北",'台北','台北','台中','台中'])[['data1','data2']]
grouped.min()

       data1     data2
台中  0.826580 -0.533099
台北 -0.173398 -0.886642